posts/Hello-World.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hello World</title>
<!-- 2015-05-18 Mon 22:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Boris Buliga &lt;d12frosted@icloud.com&gt;" />
<link rel='stylesheet' type='text/css' href='/css/default.css' />
<link rel="stylesheet" type='text/css' href='/css/leuven.css' />
<link rel='stylesheet' href='/font-awesome/css/font-awesome.min.css'>
</head>
<body>
<div id="preamble" class="status">
<header>
  <ul class='nav-list'>
    <li class='nav-elem nav-left nav-head'>
      <a href='/'><i class='fa fa-home'></i> d12frosted</a>
    </li>
    <li class='nav-elem nav-left nav-head'>
      <a href='/archive.html'><i class='fa fa-archive'></i> Archive</a>
    </li>
    <li class='nav-elem nav-left nav-head'>
      <a href='/updates.html'><i class='fa fa-refresh'></i> Latest Updates</a>
    </li>
    <li class='nav-elem nav-right'>
      <a href='http://stackoverflow.com/users/3086454/d12frosted'><i class='fa fa-stack-overflow'></i> StackOverflow</a>
    </li>
    <li class='nav-elem nav-right'>
      <a href='https://github.com/d12frosted'><i class='fa fa-github'></i> GitHub</a>
    </li>
  </ul>
</header>
</div>
<div id="content">
<h1 class="title">Hello World</h1>
<p>
Well. I am pretty sure that I wanted to write about <code>GHC.Generics</code> and how you can simplify your life by using them. Yeah, that was a great idea for the very first blog post. It's kinda advanced and not about monads, cause every one already knows, that monads are burritos (oops, have I said that out loud?).
</p>

<p>
But you know, someone already solved my problem that was forcing me to that genero-sutra. So I am just posting pretty cool "Hello World" example.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">main</span> <span style="color: #006699;">::</span> <span style="color: #6434A3;">IO</span> <span style="color: #707183;">()</span>
<span style="color: #006699;">main</span> <span style="color: #006699;">=</span> putStrLn <span style="color: #008000;">"Hello World!"</span>
</pre>
</div>

<p>
Fascinating, isn't it? No? Oh then you should know, that while I was playing with travis configurations my github password accidentally leaked out to the open world. Funny, but that was another "Hello World" example. A good one, for sure.
</p>

<p>
Have a nice morning and don't forget to make your life happier.
</p>
</div>
<div id="postamble" class="status">
<p>By Boris Buliga &lt;d12frosted@icloud.com&gt;<p><p>Created: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-01-10&gt;</span></span><p>
</div>
</body>
</html>
